Nander-Arctic-SNOWPACK-meteoio/new-run-SNOWPACKFoam/BYL-tundra-2016-2017-noHet/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    top
    {
        type            calculated;
        value           $internalField;

        //type            totalPressure;
        //p0              uniform 101325;        
    }

    bottom
    {
        type            calculated;
        value           $internalField;
        
        //type            totalPressure;
        //p0              uniform 101325;        
    }

    left
    {
        type            cyclic;
        
        //type            calculated;
        //value           $internalField;                        
    }

    right
    {
        type            cyclic; 
        
        //type            calculated;
        //value           $internalField;                      
    }

    frontAndBack
    {
        type empty;
    } 
}

// ************************************************************************* //
